# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.15-s080_1 on Sat May 10 11:16:23 CEST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design IZH_CORE

create_clock -name "my_clock" -period 10.0 -waveform {0.0 5.0} [get_ports i_clk]
set_clock_transition 0.2 [get_clocks my_clock]
set_load -pin_load -min 0.01 [get_ports {o_e[10]}]
set_load -pin_load -max 1.0 [get_ports {o_e[10]}]
set_load -pin_load -min 0.01 [get_ports {o_e[9]}]
set_load -pin_load -max 1.0 [get_ports {o_e[9]}]
set_load -pin_load -min 0.01 [get_ports {o_e[8]}]
set_load -pin_load -max 1.0 [get_ports {o_e[8]}]
set_load -pin_load -min 0.01 [get_ports {o_e[7]}]
set_load -pin_load -max 1.0 [get_ports {o_e[7]}]
set_load -pin_load -min 0.01 [get_ports {o_e[6]}]
set_load -pin_load -max 1.0 [get_ports {o_e[6]}]
set_load -pin_load -min 0.01 [get_ports {o_e[5]}]
set_load -pin_load -max 1.0 [get_ports {o_e[5]}]
set_load -pin_load -min 0.01 [get_ports {o_e[4]}]
set_load -pin_load -max 1.0 [get_ports {o_e[4]}]
set_load -pin_load -min 0.01 [get_ports {o_e[3]}]
set_load -pin_load -max 1.0 [get_ports {o_e[3]}]
set_load -pin_load -min 0.01 [get_ports {o_e[2]}]
set_load -pin_load -max 1.0 [get_ports {o_e[2]}]
set_load -pin_load -min 0.01 [get_ports {o_e[1]}]
set_load -pin_load -max 1.0 [get_ports {o_e[1]}]
set_load -pin_load -min 0.01 [get_ports {o_e[0]}]
set_load -pin_load -max 1.0 [get_ports {o_e[0]}]
set_load -pin_load -min 0.01 [get_ports o_spike]
set_load -pin_load -max 1.0 [get_ports o_spike]
set_load -pin_load -min 0.01 [get_ports {o_voltage[12]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[12]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[11]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[11]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[10]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[10]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[9]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[9]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[8]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[8]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[7]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[7]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[6]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[6]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[5]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[5]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[4]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[4]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[3]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[3]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[2]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[2]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[1]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[1]}]
set_load -pin_load -min 0.01 [get_ports {o_voltage[0]}]
set_load -pin_load -max 1.0 [get_ports {o_voltage[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports i_re]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports i_en]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports i_rst]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports i_label]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[12]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[11]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[10]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[9]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[8]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[7]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[6]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[5]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[4]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[3]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[2]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[1]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {i_current[0]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports i_re]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports i_en]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports i_rst]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports i_label]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[12]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[11]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[10]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[9]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[8]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[7]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[6]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[5]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[4]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[3]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[2]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[1]}]
set_input_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {i_current[0]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[10]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[9]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[8]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[7]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[6]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[5]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[4]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[3]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[2]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[1]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_e[0]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports o_spike]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[12]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[11]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[10]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[9]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[8]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[7]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[6]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[5]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[4]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[3]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[2]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[1]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -max 2.0 [get_ports {o_voltage[0]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[10]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[9]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[8]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[7]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[6]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[5]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[4]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[3]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[2]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[1]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_e[0]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports o_spike]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[12]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[11]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[10]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[9]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[8]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[7]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[6]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[5]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[4]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[3]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[2]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[1]}]
set_output_delay -clock [get_clocks my_clock] -network_latency_included -add_delay -min 0.1 [get_ports {o_voltage[0]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports i_clk]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports i_clk]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports i_re]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports i_re]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports i_en]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports i_en]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports i_rst]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports i_rst]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports i_label]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports i_label]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[12]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[12]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[11]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[11]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[10]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[10]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[9]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[9]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[8]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[8]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[7]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[7]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[6]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[6]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[5]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[5]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[4]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[4]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[3]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[3]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[2]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[2]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[1]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[1]}]
set_driving_cell -min -lib_cell BUFFD2 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[0]}]
set_driving_cell -max -lib_cell BUFFD24 -library tcbn65lptc_ccs -pin "Z" [get_ports {i_current[0]}]
set_wire_load_mode "segmented"
set_clock_latency  1.0 [get_clocks my_clock]
set_clock_uncertainty -setup 0.3 [get_clocks my_clock]
set_clock_uncertainty -hold 0.3 [get_clocks my_clock]
